# Applications of Python: Pandas

In [Python Intro to Python - II](https://github.com/cra-international/Intro-to-Python/tree/master/Intro%20to%20Python%20-%20II), we explore some foundamental functions provided by Pandas module in Python. 

We will now dive deeper into the Pandas package, which is an open source library built on top of NumPt. It allows for fast analysis and data cleaning and preparation and has built-in visualization features.

_Note: In the walkthrough below, the first instance of each new Pandas method or attribute will be hyperlinked directly to the Pandas documentation for that method/attribute. Feel free to reference that documentation for additional information._

# Sections
- 1. <a href='#Series'>Series</a>

    - 1.1 <a href='#CreateSeries'>Create a Series using various data types</a>
    
    - 1.1 <a href='#IndexSeries'>Using an Index in a Series</a>
    
- 2. <a href='#DataFrame'>DataFrame</a>

    - 2.1 <a href='#SelectandIndexDataFrame'>Grabing data from a dataframe </a>
    
    - 2.2 <a href='#CreateColumn'>Create a Column</a>
    
    - 2.3 <a href='#RemoveColumn'>Remove a Column</a>
        
    - 2.4 <a href='#SelectRows'>Select a row</a>
    
    - 2.5 <a href='#RemoveRows'>Remove a row</a>
    
    - 2.6 <a href='#SelectRowsColumns'>Select rows and columns</a>
    
    - 2.7 <a href='#ConditionalSelection'>Conditional Selection</a>
    
    - 2.8 <a href='#MoreIndex'>Index in dataframe</a>

        - <a href='#HierarchyIndex'>Multi-Index and Index Hierarchy</a>

    - 2.9 <a href='#MissingData'>Missing Data</a>
    
    - 2.10 <a href='#GroupBy'>Using Group by with a dataframe</a>
    
- 3. <a href='#MergeJoinConcat'>Merging, joining and Concatenation</a>

    - 3.1 <a href='#Concatenation'>Concatenation</a>
    
    - 3.2 <a href='#Merging'>Merging</a>
    
    - 3.3 <a href='#Joining'>Joining</a>
    
- 4. <a href='#Operations'>Operations</a>

    - 4.1 <a href='#SelectingData'>Selecting Data</a>
    
    - 4.2 <a href='#Applying'>Applying function to a data frame</a>
    
    - 4.3 <a href='#SortOrder'>Sort data in a data frame</a>
    
    - 4.4 <a href='#Pivot'>Pivot Table</a>
    
    - 4.5 <a href='#Transpose'>Transpose Table</a>
    
- 5. <a href='#InputData'>Data Input and Output</a>

    - 5.1 <a href='#CSV'>CSV</a>
    
    - 5.2 <a href='#Excel'>Excel</a>
    
    - 5.3 <a href='#HTML'>HTML</a>
    
    - 5.3 <a href='#SQL'>SQL</a>

# Series
<a id='Series'> </a>

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

In [1]:
import numpy as np
import pandas as pd


A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

### Creating a Series
<a id='CreateSeries'> </a>
You can convert a list,numpy array, or dictionary to a Series:

_Using List with default index setting_

In [2]:
my_list = [10,20,30]
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

_Using List with specified index_

In [3]:
labels = ['a','b','c']
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

_NumPy Arrays_

In [4]:
arr = np.array([10,20,30])

pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [5]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

_Dictionary_

In [6]:
d = {'a':10,'b':20,'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

_Data in a Series_
 - A pandas Series can hold a variety of object types:

In [7]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [8]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index
<a id='IndexSeries'> </a>

- The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).
- Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [9]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])                                   
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])                                   
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

_Operations are then also done based off of index:_

In [11]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames
<a id='DataFrame'> </a>
- DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [12]:
dates = pd.date_range("20130101", periods=4)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04'], dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame([[0,2,3,4],[1,2,0,4],[1,0,3,4],[0,2,3,4]],index=dates,columns=list("ABCD"))

In [14]:
df

            A  B  C  D
2013-01-01  0  2  3  4
2013-01-02  1  2  0  4
2013-01-03  1  0  3  4
2013-01-04  0  2  3  4

In [58]:
#Creating a DataFrame by passing a dict of objects that can be converted to series-like.

df2 = pd.DataFrame(
    data={
            "A": 1.0,
            "B": [0,2,3,4],
            "C": pd.Categorical(["test", "train", "test", "train"]),
            "D": "foo"
        },
    index=dates
    )
df2

              A  B      C    D
2013-01-01  1.0  0   test  foo
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

In [59]:
df2.dtypes

A     float64
B       int64
C    category
D      object
dtype: object

In [60]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2013-01-01 to 2013-01-04
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      int64
 2   C       4 non-null      category
 3   D       4 non-null      object
dtypes: category(1), float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [61]:
# then we can use df2 for further demonstration
df=df2.copy()

## Selection and Indexing
<a id='SelectandIndexDataFrame'> </a>
- Let's learn the various methods to grab data from a DataFrame

In [62]:
df['A']

2013-01-01    1.0
2013-01-02    1.0
2013-01-03    1.0
2013-01-04    1.0
Freq: D, Name: A, dtype: float64

In [63]:
# Pass a list of column names
df[['A','B']]

              A  B
2013-01-01  1.0  0
2013-01-02  1.0  2
2013-01-03  1.0  3
2013-01-04  1.0  4

_.loc usage_
- is primarily label based, but may also be used with a boolean array. .loc will raise KeyError when the items are not found.
- A single label, e.g. 5 or 'a' (Note that 5 is interpreted as a label of the index. This use is not an integer position along the index.).

- A list or array of labels ['a', 'b', 'c'].

- A slice object with labels 'a':'f' (Note that contrary to usual Python slices, both the start and the stop are included, when present in the index! See Slicing with labels and Endpoints are inclusive.)

- A boolean array (any NA values will be treated as False).

- A callable function with one argument (the calling Series or DataFrame) and that returns valid output for indexing (one of the above).

In [64]:
df.loc[:, ['A', 'B']]

              A  B
2013-01-01  1.0  0
2013-01-02  1.0  2
2013-01-03  1.0  3
2013-01-04  1.0  4

In [65]:
df.loc[:, 'A':'C']

              A  B      C
2013-01-01  1.0  0   test
2013-01-02  1.0  2  train
2013-01-03  1.0  3   test
2013-01-04  1.0  4  train

_.iloc_ usgae
- is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array. .iloc will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing. (this conforms with Python/NumPy slice semantics). Allowed inputs are:

- An integer e.g. 5.

- A list or array of integers [4, 3, 0].

- A slice object with ints 1:7.

- A boolean array (any NA values will be treated as False).

- A callable function with one argument (the calling Series or DataFrame) and that returns valid output for indexing (one of the above).

In [66]:
df.iloc[:, :2]

              A  B
2013-01-01  1.0  0
2013-01-02  1.0  2
2013-01-03  1.0  3
2013-01-04  1.0  4

_SQL Syntax_

In [67]:
df.A

2013-01-01    1.0
2013-01-02    1.0
2013-01-03    1.0
2013-01-04    1.0
Freq: D, Name: A, dtype: float64

_DataFrame Columns are just Series_

In [68]:
type(df['B'])

pandas.core.series.Series

### Creating a new column:
<a id='CreateColumn'> </a>

In [69]:
df['new'] = df['A'] + df['B']

In [70]:
df

              A  B      C    D  new
2013-01-01  1.0  0   test  foo  1.0
2013-01-02  1.0  2  train  foo  3.0
2013-01-03  1.0  3   test  foo  4.0
2013-01-04  1.0  4  train  foo  5.0

### Removing Columns
<a id='RemoveColumn'> </a>

In [71]:
df.drop('new',axis=1)

              A  B      C    D
2013-01-01  1.0  0   test  foo
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

In [72]:
df

              A  B      C    D  new
2013-01-01  1.0  0   test  foo  1.0
2013-01-02  1.0  2  train  foo  3.0
2013-01-03  1.0  3   test  foo  4.0
2013-01-04  1.0  4  train  foo  5.0

In [73]:
# Not inplace unless specified!
df.drop('new',axis=1,inplace=True)

### Selecting Rows
<a id='SelectRows'> </a>

In [74]:
df

              A  B      C    D
2013-01-01  1.0  0   test  foo
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

In [75]:
df.loc['2013-01-01',:]

A       1
B       0
C    test
D     foo
Name: 2013-01-01 00:00:00, dtype: object

In [76]:
df.loc[:'2013-01-03',:]

              A  B      C    D
2013-01-01  1.0  0   test  foo
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo

#### Or select based off of position instead of label

In [77]:
df.iloc[2]

A       1
B       3
C    test
D     foo
Name: 2013-01-03 00:00:00, dtype: object

In [78]:
df.iloc[:2]

              A  B      C    D
2013-01-01  1.0  0   test  foo
2013-01-02  1.0  2  train  foo

### Removing rows
<a id='RemoveRows'> </a>

In [79]:
df.drop(pd.to_datetime('2013-01-01'),axis=0)

              A  B      C    D
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

### Selecting subset of rows and columns
<a id='SelectRowsColumns'> </a>

In [80]:
df.loc['2013-01-02','C']

'train'

In [81]:
df.loc[[pd.to_datetime('2013-01-01'),pd.to_datetime('2013-01-02')],['A','B']]

              A  B
2013-01-01  1.0  0
2013-01-02  1.0  2

In [82]:
df.iloc[0:2, 0:2]

              A  B
2013-01-01  1.0  0
2013-01-02  1.0  2

### Conditional Selection
<a id='ConditionalSelection'> </a>
- An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [83]:
#df>0

In [84]:
df[df['B']>0]

              A  B      C    D
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

In [85]:
df[df['B']>0]['C']

2013-01-02    train
2013-01-03     test
2013-01-04    train
Freq: D, Name: C, dtype: category
Categories (2, object): [test, train]

In [86]:
df[df['B']>0][['C','D']]

                C    D
2013-01-02  train  foo
2013-01-03   test  foo
2013-01-04  train  foo

#### For two conditions you can use | and & with parenthesis:

In [87]:
df[(df['A']>0) & (df['B'] > 1)]

              A  B      C    D
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

In [88]:
df[(df['A']>0) | (df['B'] > 1)]

              A  B      C    D
2013-01-01  1.0  0   test  foo
2013-01-02  1.0  2  train  foo
2013-01-03  1.0  3   test  foo
2013-01-04  1.0  4  train  foo

In [89]:
#similarily, you can use string to check equality
df[df['C']=='train']

              A  B      C    D
2013-01-02  1.0  2  train  foo
2013-01-04  1.0  4  train  foo

### More Index Details
<a id='MoreIndex'> </a>
- Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [90]:
# Reset to default 0,1...n index
df.reset_index()

       index    A  B      C    D
0 2013-01-01  1.0  0   test  foo
1 2013-01-02  1.0  2  train  foo
2 2013-01-03  1.0  3   test  foo
3 2013-01-04  1.0  4  train  foo

In [91]:
newind = 'CA NY WY OR'.split()

In [92]:
df['States'] = newind

In [93]:
df.set_index('States')

          A  B      C    D
States
CA      1.0  0   test  foo
NY      1.0  2  train  foo
WY      1.0  3   test  foo
OR      1.0  4  train  foo

In [94]:
df.set_index('States',inplace=True)

#### Multi-Index and Index Hierarchy
<a id='HierarchyIndex'> </a>
Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [100]:
df

  States    A  B      C    D
0     CA  1.0  0   test  foo
1     NY  1.0  2  train  foo
2     WY  1.0  3   test  foo
3     OR  1.0  4  train  foo

In [101]:
# adding an output index
outside = ['G1','G1','G2','G2']

In [103]:
df['outside_index'] = outside
df.set_index(['outside_index','States'])

                        A  B      C    D
outside_index States
G1            CA      1.0  0   test  foo
              NY      1.0  2  train  foo
G2            WY      1.0  3   test  foo
              OR      1.0  4  train  foo

In [105]:
df.set_index(['outside_index','States'],inplace=True)

_Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:_

In [106]:
df.loc['G1']

          A  B      C    D
States
CA      1.0  0   test  foo
NY      1.0  2  train  foo

In [108]:
df.loc['G1'].iloc[1]

A        1
B        2
C    train
D      foo
Name: NY, dtype: object

In [109]:
df.index.names

FrozenList(['outside_index', 'States'])

In [110]:
df

                        A  B      C    D
outside_index States
G1            CA      1.0  0   test  foo
              NY      1.0  2  train  foo
G2            WY      1.0  3   test  foo
              OR      1.0  4  train  foo

In [111]:
df.xs('G1')

          A  B      C    D
States
CA      1.0  0   test  foo
NY      1.0  2  train  foo

In [113]:
df.xs(('G1','CA'))

A       1
B       0
C    test
D     foo
Name: (G1, CA), dtype: object

In [114]:
df.xs('CA',level='States')

                 A  B     C    D
outside_index
G1             1.0  0  test  foo

# Missing Data
<a id='MissingData'> </a>

Let's show a few convenient methods to deal with Missing Data in pandas:

In [115]:
#Lets add some missing data to the dataframe
df['E']=[4,5, np.nan, 9]

_checking missing data_

In [116]:
df.isna()
#df.isnull()
#pd.isna(df)

                          A      B      C      D      E
outside_index States
G1            CA      False  False  False  False  False
              NY      False  False  False  False  False
G2            WY      False  False  False  False   True
              OR      False  False  False  False  False

In [117]:
#check row with missing value in a column
df[df.A.isna()]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [118]:
df[df.E.isna()]

                        A  B     C    D   E
outside_index States
G2            WY      1.0  3  test  foo NaN

In [119]:
df.dropna()

                        A  B      C    D    E
outside_index States
G1            CA      1.0  0   test  foo  4.0
              NY      1.0  2  train  foo  5.0
G2            OR      1.0  4  train  foo  9.0

In [120]:
df.dropna(axis=1)

                        A  B      C    D
outside_index States
G1            CA      1.0  0   test  foo
              NY      1.0  2  train  foo
G2            WY      1.0  3   test  foo
              OR      1.0  4  train  foo

In [121]:
df.dropna(thresh=2)

                        A  B      C    D    E
outside_index States
G1            CA      1.0  0   test  foo  4.0
              NY      1.0  2  train  foo  5.0
G2            WY      1.0  3   test  foo  NaN
              OR      1.0  4  train  foo  9.0

In [128]:
df['E'].fillna(value=df['E'].mean())

outside_index  States
G1             CA        4.0
               NY        5.0
G2             WY        6.0
               OR        9.0
Name: E, dtype: float64

In [129]:
df['E'].mean()

6.0

# Groupby
<a id='GroupBy'> </a>

The groupby method allows you to group rows of data together and call aggregate functions

#### Now you can use the .groupby() method to group rows together based off of a column name. This will create a DataFrameGroupBy object:

In [131]:
df.groupby('C')

In [132]:
#You can save this object as a new variable:
by_comp = df.groupby("C")

In [133]:
# then call aggregate methods off the object:
by_comp.mean()

         A    B    E
C
test   1.0  1.5  4.0
train  1.0  3.0  7.0

In [134]:
df.groupby('C').mean()

         A    B    E
C
test   1.0  1.5  4.0
train  1.0  3.0  7.0

In [135]:
df.groupby('C').min()

         A  B    D    E
C
test   1.0  0  foo  4.0
train  1.0  2  foo  5.0

In [136]:
df.groupby('C').max()

         A  B    D    E
C
test   1.0  3  foo  4.0
train  1.0  4  foo  9.0

In [137]:
df.groupby('C').std()

         A         B         E
C
test   0.0  2.121320       NaN
train  0.0  1.414214  2.828427

In [138]:
df.groupby('C').count()

       A  B  D  E
C
test   2  2  2  1
train  2  2  2  2

In [139]:
df.groupby('C').describe()

          A                                        B       ...             \
      count mean  std  min  25%  50%  75%  max count mean  ...   75%  max
C                                                          ...
test    2.0  1.0  0.0  1.0  1.0  1.0  1.0  1.0   2.0  1.5  ...  2.25  3.0
train   2.0  1.0  0.0  1.0  1.0  1.0  1.0  1.0   2.0  3.0  ...  3.50  4.0

          E
      count mean       std  min  25%  50%  75%  max
C
test    1.0  4.0       NaN  4.0  4.0  4.0  4.0  4.0
train   2.0  7.0  2.828427  5.0  6.0  7.0  8.0  9.0

[2 rows x 24 columns]

In [140]:
df.groupby('C').describe().transpose()

C           test     train
A count  2.00000  2.000000
  mean   1.00000  1.000000
  std    0.00000  0.000000
  min    1.00000  1.000000
  25%    1.00000  1.000000
  50%    1.00000  1.000000
  75%    1.00000  1.000000
  max    1.00000  1.000000
B count  2.00000  2.000000
  mean   1.50000  3.000000
  std    2.12132  1.414214
  min    0.00000  2.000000
  25%    0.75000  2.500000
  50%    1.50000  3.000000
  75%    2.25000  3.500000
  max    3.00000  4.000000
E count  1.00000  2.000000
  mean   4.00000  7.000000
  std        NaN  2.828427
  min    4.00000  5.000000
  25%    4.00000  6.000000
  50%    4.00000  7.000000
  75%    4.00000  8.000000
  max    4.00000  9.000000

In [146]:
df.groupby('C')['A'].describe().transpose()

C      test  train
count   2.0    2.0
mean    1.0    1.0
std     0.0    0.0
min     1.0    1.0
25%     1.0    1.0
50%     1.0    1.0
75%     1.0    1.0
max     1.0    1.0

_By default, group by column will be set as index;but you can set the as_index option to be false_

In [150]:
df.groupby('C').min()

         A  B    D    E
C
test   1.0  0  foo  4.0
train  1.0  2  foo  5.0

In [151]:
df.groupby('C',as_index=False).min()

       C    A  B    D    E
0   test  1.0  0  foo  4.0
1  train  1.0  2  foo  5.0

In [152]:
#similarily, you can use syntax below
df.groupby('C').min().reset_index()

       C    A  B    D    E
0   test  1.0  0  foo  4.0
1  train  1.0  2  foo  5.0

# Merging, Joining, and Concatenating
<a id='MergeJoinConcat'> </a>

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

In [171]:
## Example DataFrames

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [172]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [173]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

### Concatenation
<a id='Concatenation'> </a>

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [174]:
pd.concat([left,right])

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
0  K0  NaN  NaN   C0   D0
1  K1  NaN  NaN   C1   D1
2  K2  NaN  NaN   C2   D2
3  K3  NaN  NaN   C3   D3

In [175]:
pd.concat([left,right],axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

## Merging
<a id='Merging'> </a>

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [176]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [177]:
left.merge(right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or merge on multiple keys:

In [178]:
left['key2'] = ['K0', 'K1', 'K0', 'K1']
    
right['key2'] = ['K0', 'K0', 'K0', 'K0']

In [181]:
pd.merge(left, right, on=['key', 'key2'])

  key   A   B key2   C   D
0  K0  A0  B0   K0  C0  D0
1  K2  A2  B2   K0  C2  D2

In [183]:
pd.merge(left, right, how='outer', on=['key', 'key2'])

  key    A    B key2    C    D
0  K0   A0   B0   K0   C0   D0
1  K1   A1   B1   K1  NaN  NaN
2  K2   A2   B2   K0   C2   D2
3  K3   A3   B3   K1  NaN  NaN
4  K1  NaN  NaN   K0   C1   D1
5  K3  NaN  NaN   K0   C3   D3

In [184]:
pd.merge(left, right, how='right', on=['key', 'key2'])

  key    A    B key2   C   D
0  K0   A0   B0   K0  C0  D0
1  K2   A2   B2   K0  C2  D2
2  K1  NaN  NaN   K0  C1  D1
3  K3  NaN  NaN   K0  C3  D3

In [185]:
pd.merge(left, right, how='left', on=['key', 'key2'])

  key   A   B key2    C    D
0  K0  A0  B0   K0   C0   D0
1  K1  A1  B1   K1  NaN  NaN
2  K2  A2  B2   K0   C2   D2
3  K3  A3  B3   K1  NaN  NaN

**Keys don't have to be with same names; if keys have different names in two data frame, you can use left_on and right_on parameters in merge function**

## Joining
<a id='Joining'> </a>

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [187]:
left.index=['K0', 'K1', 'K2', 'K3']

right.index=['K0', 'K4', 'K5', 'K6']

In [188]:
left

   key   A   B key2
K0  K0  A0  B0   K0
K1  K1  A1  B1   K1
K2  K2  A2  B2   K0
K3  K3  A3  B3   K1

In [189]:
right

   key   C   D key2
K0  K0  C0  D0   K0
K4  K1  C1  D1   K0
K5  K2  C2  D2   K0
K6  K3  C3  D3   K0

In [191]:
#left.join(right)
left.join(right,lsuffix='_left', rsuffix='_right')

   key_left   A   B key2_left key_right    C    D key2_right
K0       K0  A0  B0        K0        K0   C0   D0         K0
K1       K1  A1  B1        K1       NaN  NaN  NaN        NaN
K2       K2  A2  B2        K0       NaN  NaN  NaN        NaN
K3       K3  A3  B3        K1       NaN  NaN  NaN        NaN

In [192]:
left.join(right,lsuffix='_left', rsuffix='_right', how='outer')

   key_left    A    B key2_left key_right    C    D key2_right
K0       K0   A0   B0        K0        K0   C0   D0         K0
K1       K1   A1   B1        K1       NaN  NaN  NaN        NaN
K2       K2   A2   B2        K0       NaN  NaN  NaN        NaN
K3       K3   A3   B3        K1       NaN  NaN  NaN        NaN
K4      NaN  NaN  NaN       NaN        K1   C1   D1         K0
K5      NaN  NaN  NaN       NaN        K2   C2   D2         K0
K6      NaN  NaN  NaN       NaN        K3   C3   D3         K0

# Operations
<a id='Operations'> </a>
There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

### Unique Values
<a id='UniqueValues'> </a>

In [196]:
df.head(3)

                        A  B      C    D    E
outside_index States
G1            CA      1.0  0   test  foo  4.0
              NY      1.0  2  train  foo  5.0
G2            WY      1.0  3   test  foo  NaN

In [197]:
#you can also look at bottom records
df.tail(3)

                        A  B      C    D    E
outside_index States
G1            NY      1.0  2  train  foo  5.0
G2            WY      1.0  3   test  foo  NaN
              OR      1.0  4  train  foo  9.0

In [200]:
df['C'].unique()

[test, train]
Categories (2, object): [test, train]

In [201]:
df['C'].nunique()

2

In [202]:
df['C'].value_counts()

train    2
test     2
Name: C, dtype: int64

### Selecting Data
<a id='SelectingData'> </a>

In [204]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['E']>2) & (df['C']=='train')]

newdf

                        A  B      C    D    E
outside_index States
G1            NY      1.0  2  train  foo  5.0
G2            OR      1.0  4  train  foo  9.0

In [207]:
df[df["C"].isin(["train", "a"])]

                        A  B      C    D    E
outside_index States
G1            NY      1.0  2  train  foo  5.0
G2            OR      1.0  4  train  foo  9.0

In [209]:
#you can also filter records with partially matched string
df[df["C"].str.contains('est')]

                        A  B     C    D    E
outside_index States
G1            CA      1.0  0  test  foo  4.0
G2            WY      1.0  3  test  foo  NaN

### Applying Functions
<a id='Applying'> </a>

In [210]:
### Applying Functions

def times2(x):
    return x*2

In [211]:
df['A'].apply(times2)

outside_index  States
G1             CA        2.0
               NY        2.0
G2             WY        2.0
               OR        2.0
Name: A, dtype: float64

In [212]:
#len function returns the length of the value
df['C'].apply(len)

outside_index  States
G1             CA        4
               NY        5
G2             WY        4
               OR        5
Name: C, dtype: category
Categories (2, int64): [4, 5]

In [213]:
df['A'].sum()

4.0

_Permanently Removing a Column_

you can also drop a column without using the drop function

In [214]:
del df['D']

In [215]:
df

                        A  B      C    E
outside_index States
G1            CA      1.0  0   test  4.0
              NY      1.0  2  train  5.0
G2            WY      1.0  3   test  NaN
              OR      1.0  4  train  9.0

### Get column and index names
<a id='GetColumnandIndex'> </a>

In [216]:
df.columns

Index(['A', 'B', 'C', 'E'], dtype='object')

In [217]:
df.index

MultiIndex([('G1', 'CA'),
            ('G1', 'NY'),
            ('G2', 'WY'),
            ('G2', 'OR')],
           names=['outside_index', 'States'])

### Sorting and Ordering a DataFrame
<a id='SortOrder'> </a>

In [218]:
df

                        A  B      C    E
outside_index States
G1            CA      1.0  0   test  4.0
              NY      1.0  2  train  5.0
G2            WY      1.0  3   test  NaN
              OR      1.0  4  train  9.0

In [219]:
df.sort_values(by='C',ascending=True) #inplace=False by default

                        A  B      C    E
outside_index States
G1            CA      1.0  0   test  4.0
G2            WY      1.0  3   test  NaN
G1            NY      1.0  2  train  5.0
G2            OR      1.0  4  train  9.0

In [220]:
df.sort_values(by=['C','E'],ascending=[False,True]) #inplace=False by default

                        A  B      C    E
outside_index States
G1            NY      1.0  2  train  5.0
G2            OR      1.0  4  train  9.0
G1            CA      1.0  0   test  4.0
G2            WY      1.0  3   test  NaN

### Pivot Table
<a id='Pivot'> </a>

In [222]:
df=df.reset_index()
df

  outside_index States    A  B      C    E
0            G1     CA  1.0  0   test  4.0
1            G1     NY  1.0  2  train  5.0
2            G2     WY  1.0  3   test  NaN
3            G2     OR  1.0  4  train  9.0

In [226]:
df.pivot_table(values='B',index=['outside_index', 'C'],columns=['States'])

States                CA   NY   OR   WY
outside_index C
G1            test   0.0  NaN  NaN  NaN
              train  NaN  2.0  NaN  NaN
G2            test   NaN  NaN  NaN  3.0
              train  NaN  NaN  4.0  NaN

# Transpose table
<a id='Transpose'> </a>

In [228]:
df.T

                  0      1     2      3
outside_index    G1     G1    G2     G2
States           CA     NY    WY     OR
A                 1      1     1      1
B                 0      2     3      4
C              test  train  test  train
E                 4      5   NaN      9

# Data Input and Output
<a id='InputData'> </a>
This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

## CSV
<a id='CSV'> </a>

In [229]:
### CSV Input

df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## Excel
<a id='Excel'> </a>
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

In [231]:
### Excel Input
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [ ]:
### Excel Output
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

## HTML
<a id='HTML'> </a>

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

In [234]:
### HTML Input

#Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

df = pd.read_html('https://en.wikipedia.org/wiki/Pythonidae')

In [235]:
len(df)

8

In [236]:
#Now, we get a list of 8 tables. If we go to the Wikipedia page, we can see that the first table is the one to the right. 
df[1]

,Pythonidae,Pythonidae.1
0,NaN,NaN
1,Indian python (Python molurus),Indian python (Python molurus)
2,Scientific classification,Scientific classification
3,Kingdom:,Animalia
4,Phylum:,Chordata
5,Class:,Reptilia
6,Order:,Squamata
7,Suborder:,Serpentes
8,Superfamily:,Pythonoidea
9,Family:,"PythonidaeFitzinger, 1826"
10,Synonyms,Synonyms
11,"Pythonoidia - Fitzinger, 1826 Pythonoidei - Ei...","Pythonoidia - Fitzinger, 1826 Pythonoidei - Ei..."

In [237]:
df[2]

,Genus[2],Taxon author[2],Species[2],Subsp.[a][2],Common name,Geographic range[1]
0,Antaresia,"Wells & Wellington, 1984",4,2,Children's pythons,Australia in arid and tropical regions
1,Apodora[13],"Kluge, 1993",1,0,Papuan olive python,Papua New Guinea
2,Aspidites,"Peters, 1877",2,0,Shield pythons,Australia except in the south of the country
3,Bothrochilus,"Fitzinger, 1843",7,0,White-lipped pythons,"Most of New Guinea (below 1,200 metres (3,900..."
4,Frangerenteur,"???, 1957",2; Possibly F. Comorodus,0,Snaptrap pythons,Comoros and Northern Madagascar
5,Liasis,"Gray, 1842",3,5,Water pythons,"Indonesia in the Lesser Sunda Islands, east th..."
6,Malayopython,"Reynolds, 2014",2,3,Reticulated and Timor pythons,From India to Timor
7,Morelia,"Gray, 1842",8,6,Tree pythons,"From Indonesia in the Maluku Islands, east thr..."
8,Python[b],"Daudin, 1803",10,2,"""True"" pythons",Africa in the tropics south of the Sahara (not...
9,Simalia,"Gray, 1849",7,0,Amethystine python species complex,Found in Indonesia (Including the islands of H...

# SQL
<a id='SQL'> </a>

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Pythons standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [238]:
from sqlalchemy import create_engine

In [240]:
engine = create_engine('sqlite:///:memory:')

df[1].to_sql('data', engine)

sql_df = pd.read_sql('data',con=engine)

sql_df

,index,Pythonidae,Pythonidae.1
0,0,None,None
1,1,Indian python (Python molurus),Indian python (Python molurus)
2,2,Scientific classification,Scientific classification
3,3,Kingdom:,Animalia
4,4,Phylum:,Chordata
5,5,Class:,Reptilia
6,6,Order:,Squamata
7,7,Suborder:,Serpentes
8,8,Superfamily:,Pythonoidea
9,9,Family:,"PythonidaeFitzinger, 1826"
10,10,Synonyms,Synonyms
11,11,"Pythonoidia - Fitzinger, 1826 Pythonoidei - Ei...","Pythonoidia - Fitzinger, 1826 Pythonoidei - Ei..."